doc/org-mode/elements.org
# vim: ts=2 sw=2 et ft=org
#+STYLE: <LINK href="stylesheet.css" rel="stylesheet" type="text/css" />
#+TITLE: Nitrogen 2.x Documentation
#+AUTHOR: Rusty Klophaus (@rustyio)
#+OPTIONS:   H:2 num:1 toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+EMAIL: 
#+TEXT: [[file:./index.org][Getting Started]] | [[file:./api.org][API]] | *Elements* | [[file:./actions.org][Actions]] | [[file:./validators.org][Validators]] | [[file:./handlers.org][Handlers]] | [[file:./config.org][Configuration Options]] | [[file:./about.org][About]]
#+HTML: <div class=headline>Nitrogen Elements</div>

* Base Element
  + [[./elements/base.org][Base Element]] - All elements contain these attributes. 
* Layout
  + [[./elements/template.org][Template]]
  + [[./elements/panel.org][Panel]]
  + [[./elements/span.org][Span]]
  + [[./elements/fieldset.org][Fieldset]]
  + [[./elements/table.org][Table]] | [[./elements/tablerow.org][Row]] | [[./elements/tablecell.org][Cell]] | [[./elements/tableheader.org][Header Cell]]
  + [[./elements/singlerow.org][Single Row Table]]
  + [[./elements/lightbox.org][Lightbox]]
  + [[./elements/label.org][Label]]
  + [[./elements/value.org][Value]]
  + [[./elements/list.org][Lists]] | [[./elements/listitem.org][List Items]]

* HTML
  + [[./elements/h1.org][Heading 1]] | [[./elements/h2.org][Heading 2]] | [[./elements/h3.org][Heading 3]] | [[./elements/h4.org][Heading 4]]
  + [[./elements/p.org][Paragraph]]
  + [[./elements/br.org][Break]]
  + [[./elements/image.org][Image]]
  + [[./elements/link.org][Link]]
  + [[./elements/literal.org][Literal]]
  + [[./elements/hr.org][Horizontal Rule]]

* Form
  + [[./elements/button.org][Button]]
  + [[./elements/textbox.org][Textbox]]
  + [[./elements/textarea.org][Textarea]]
  + [[./elements/checkbox.org][Checkbox]]
  + [[./elements/dropdown.org][Dropdown]] | [[./elements/option.org][Dropdown Option]]
  + [[./elements/password.org][Password Box]]
  + [[./elements/hidden.org][Hidden Value]]
  + [[./elements/inplace.org][General In-Place Element]]
  + [[./elements/inplace_textbox.org][In-Place Textbox]]
  + [[./elements/inplace_textarea.org][In-Place Textarea]]
  + [[./elements/spinner.org][AJAX Spinner]]

* Mobile Elements
  + [[./elements/jquery_mobile.org][jQuery Mobile Elements]]
  + [[./elements/mobile_list.org][Mobile List]] | [[./elements/mobile_list_item.org][Mobile List Item]] | [[./elements/mobile_list_divider.org][Mobile List Divider]]
  + [[./elements/mobile_slider.org][Mobile Slider]]
  + [[./elements/mobile_collapsible.org][Mobile Collapsible]]
  + [[./elements/mobile_collapsible_set.org][Mobile Collapsible Set]]
  + [[./elements/mobile_grid.org][Mobile Grid]] | [[./elements/mobile_grid_block.org][Mobile Grid Block]]

* RESTful Elements
  + [[./elements/restful_overview.org][RESTful Overview]]
  + [[./elements/restful_form.org][RESTful Form]]
  + [[./elements/restful_submit.org][RESTful Submit]]
  + [[./elements/restful_reset.org][RESTful Reset]]
  + [[./elements/restful_upload.org][RESTful Upload]]

* Other
  + [[./elements/bind.org][Bind]]
  + [[./elements/file.org][File]]
  + [[./elements/flash.org][Flash]]
  + [[./elements/draggable.org][Draggable]]
  + [[./elements/droppable.org][Droppable]]
  + [[./elements/sortblock.org][Sort Block]]
  + [[./elements/sortitem.org][Sort Item]]
  + [[./elements/gravatar.org][Gravatar]]
  + [[./elements/recaptcha.org][Recaptcha]]

* See Also
  + [[./paths.org][Nitrogen Element Paths]]
  + [[./jquery_mobile_integration.org][jQuery Mobile Integration]]

