doc/html/elements.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Nitrogen 2.x Documentation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Nitrogen 2.x Documentation"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-31 21:51:02 CDT"/>
<meta name="author" content="Rusty Klophaus (@rustyio)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Nitrogen 2.x Documentation</h1>

<p><a href="./index.html">Getting Started</a> | <a href="./api.html">API</a> | <b>Elements</b> | <a href="./actions.html">Actions</a> | <a href="./validators.html">Validators</a> | <a href="./handlers.html">Handlers</a> | <a href="./config.html">Configuration Options</a> | <a href="./about.html">About</a>
<div class=headline>Nitrogen Elements</div>

</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Base Element</a></li>
<li><a href="#sec-2">2 Layout</a></li>
<li><a href="#sec-3">3 HTML</a></li>
<li><a href="#sec-4">4 Form</a></li>
<li><a href="#sec-5">5 Mobile Elements</a></li>
<li><a href="#sec-6">6 RESTful Elements</a></li>
<li><a href="#sec-7">7 Other</a></li>
<li><a href="#sec-8">8 See Also</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Base Element</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li><a href="./elements/base.html">Base Element</a> - All elements contain these attributes. 
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Layout</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li><a href="./elements/template.html">Template</a>
</li>
<li><a href="./elements/panel.html">Panel</a>
</li>
<li><a href="./elements/span.html">Span</a>
</li>
<li><a href="./elements/fieldset.html">Fieldset</a>
</li>
<li><a href="./elements/table.html">Table</a> | <a href="./elements/tablerow.html">Row</a> | <a href="./elements/tablecell.html">Cell</a> | <a href="./elements/tableheader.html">Header Cell</a>
</li>
<li><a href="./elements/singlerow.html">Single Row Table</a>
</li>
<li><a href="./elements/lightbox.html">Lightbox</a>
</li>
<li><a href="./elements/label.html">Label</a>
</li>
<li><a href="./elements/value.html">Value</a>
</li>
<li><a href="./elements/list.html">Lists</a> | <a href="./elements/listitem.html">List Items</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> HTML</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li><a href="./elements/h1.html">Heading 1</a> | <a href="./elements/h2.html">Heading 2</a> | <a href="./elements/h3.html">Heading 3</a> | <a href="./elements/h4.html">Heading 4</a>
</li>
<li><a href="./elements/p.html">Paragraph</a>
</li>
<li><a href="./elements/br.html">Break</a>
</li>
<li><a href="./elements/image.html">Image</a>
</li>
<li><a href="./elements/link.html">Link</a>
</li>
<li><a href="./elements/literal.html">Literal</a>
</li>
<li><a href="./elements/hr.html">Horizontal Rule</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Form</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li><a href="./elements/button.html">Button</a>
</li>
<li><a href="./elements/textbox.html">Textbox</a>
</li>
<li><a href="./elements/textarea.html">Textarea</a>
</li>
<li><a href="./elements/checkbox.html">Checkbox</a>
</li>
<li><a href="./elements/dropdown.html">Dropdown</a> | <a href="./elements/option.html">Dropdown Option</a>
</li>
<li><a href="./elements/password.html">Password Box</a>
</li>
<li><a href="./elements/hidden.html">Hidden Value</a>
</li>
<li><a href="./elements/inplace.html">General In-Place Element</a>
</li>
<li><a href="./elements/inplace_textbox.html">In-Place Textbox</a>
</li>
<li><a href="./elements/inplace_textarea.html">In-Place Textarea</a>
</li>
<li><a href="./elements/spinner.html">AJAX Spinner</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Mobile Elements</h2>
<div class="outline-text-2" id="text-5">

<ul>
<li><a href="./elements/jquery_mobile.html">jQuery Mobile Elements</a>
</li>
<li><a href="./elements/mobile_list.html">Mobile List</a> | <a href="./elements/mobile_list_item.html">Mobile List Item</a> | <a href="./elements/mobile_list_divider.html">Mobile List Divider</a>
</li>
<li><a href="./elements/mobile_slider.html">Mobile Slider</a>
</li>
<li><a href="./elements/mobile_collapsible.html">Mobile Collapsible</a>
</li>
<li><a href="./elements/mobile_collapsible_set.html">Mobile Collapsible Set</a>
</li>
<li><a href="./elements/mobile_grid.html">Mobile Grid</a> | <a href="./elements/mobile_grid_block.html">Mobile Grid Block</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> RESTful Elements</h2>
<div class="outline-text-2" id="text-6">

<ul>
<li><a href="./elements/restful_overview.html">RESTful Overview</a>
</li>
<li><a href="./elements/restful_form.html">RESTful Form</a>
</li>
<li><a href="./elements/restful_submit.html">RESTful Submit</a>
</li>
<li><a href="./elements/restful_reset.html">RESTful Reset</a>
</li>
<li><a href="./elements/restful_upload.html">RESTful Upload</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Other</h2>
<div class="outline-text-2" id="text-7">

<ul>
<li><a href="./elements/bind.html">Bind</a>
</li>
<li><a href="./elements/file.html">File</a>
</li>
<li><a href="./elements/flash.html">Flash</a>
</li>
<li><a href="./elements/draggable.html">Draggable</a>
</li>
<li><a href="./elements/droppable.html">Droppable</a>
</li>
<li><a href="./elements/sortblock.html">Sort Block</a>
</li>
<li><a href="./elements/sortitem.html">Sort Item</a>
</li>
<li><a href="./elements/gravatar.html">Gravatar</a>
</li>
<li><a href="./elements/recaptcha.html">Recaptcha</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> See Also</h2>
<div class="outline-text-2" id="text-8">

<ul>
<li><a href="./paths.html">Nitrogen Element Paths</a>
</li>
<li><a href="./jquery_mobile_integration.html">jQuery Mobile Integration</a>
</li>
</ul>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-31 21:51:02 CDT</p>
<p class="author">Author: Rusty Klophaus (@rustyio)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/elements.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
